In [1]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [34]:
titles = pd.read_csv('data/titles.csv', index_col=None)
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [3]:
cast = pd.read_csv('data/cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### What are the ten most common movie names of all time?

In [13]:
title_freq = titles.groupby('title').count()
title_freq
title_freq.sort_values('year',ascending=False).head(10)

                      year
title
Hamlet                  18
Carmen                  16
Macbeth                 15
The Outsider            12
Maya                    12
Freedom                 11
The Three Musketeers    11
Temptation              11
Othello                 11
Kismet                  11

### Which three years of the 1930s saw the most films released?

In [18]:
titles_1930s = titles[titles['year'].between(1930,1939,inclusive=True)].groupby('year').count()
titles_1930s.sort_values('title',ascending=False).head(3)

      title
year
1937   1196
1936   1138
1938   1129

### Count the number of films that have been released each decade over the history of cinema.

In [35]:
titles['year'].agg(['min','max'])

min    1894
max    2026
Name: year, dtype: int64

In [40]:
titles['decade'] = titles['year'] - titles['year'] % 10
titles.groupby('decade').count()

        title   year
decade
1890        3      3
1900       37     37
1910     6512   6512
1920     8797   8797
1930    10097  10097
1940     8576   8576
1950    12711  12711
1960    17515  17515
1970    18714  18714
1980    20243  20243
1990    22225  22225
2000    38713  38713
2010    67977  67977
2020      210    210

### Count the number of "Hamlet" films made each decade.

In [43]:
titles[titles['title']=='Hamlet'].groupby('decade').count()

        title  year
decade
1910        3     3
1920        1     1
1940        1     1
1950        1     1
1960        2     2
1970        2     2
1980        1     1
1990        2     2
2000        2     2
2010        3     3

### Count the number of "Rustler" characters in each decade of the history of film.

In [48]:
cast['decade'] = cast['year'] -  cast['year']%10 
cast[cast['character']=="Rustler"].groupby('decade')['title'].count()

decade
1920     6
1930    84
1940    18
1950     8
1960     2
1970     9
1980     1
1990     4
2000     2
Name: title, dtype: int64

### Count the number of "Hamlet" characters each decade.

In [50]:
cast[cast['character']=="Hamlet"].groupby('decade')['title'].count()

decade
1910     6
1920     1
1930     6
1940     1
1950     3
1960     7
1970     8
1980     2
1990    11
2000    19
2010    28
Name: title, dtype: int64

### What are the 11 most common character names in movie history?

In [54]:
common_names = cast.groupby('character')['title'].count().sort_values(ascending = False).head(11)

In [55]:
common_names

character
Himself        19600
Dancer         12096
Extra          10953
Reporter        8154
Doctor          7436
Student         7177
Policeman       6883
Party Guest     6742
Nurse           6676
Bartender       6613
Minor Role      6255
Name: title, dtype: int64

### Who are the 10 people most often credited as "Herself" in film history?

In [61]:
cast[cast['character'] == 'Herself'].groupby('name')['name'].count().sort_values(ascending = False).head(10)

name
Queen Elizabeth II    11
Joyce Brothers         9
Margaret Thatcher      8
Mary Jo Pehl           7
Hillary Clinton        7
Joan Rivers            6
Sumie Sakai            6
Caroline Rhea          5
Kareena Kapoor         5
Rekha                  5
Name: name, dtype: int64

### Who are the 10 people most often credited as "Himself" in film history?

In [60]:
cast[cast['character'] == 'Himself'].groupby('name')['name'].count().sort_values(ascending = False).head(10)

name
Adolf Hitler          100
Richard Nixon          46
Ronald Reagan          39
John F. Kennedy        34
Winston Churchill      24
George W. Bush         23
Benito Mussolini       23
Ron Jeremy             23
Martin Luther King     21
Bill Clinton           20
Name: name, dtype: int64

### Which actors or actresses appeared in the most movies in the year 1945?

In [63]:
cast[cast['year']==1945].groupby('name')['name'].count().sort_values(ascending = False)

name
Emmett Vogan       39
Sam (II) Harris    32
Bess Flowers       29
Harold Miller      29
Nolan Leary        27
                   ..
Henry Kendall       1
Henry Mirelez       1
Henry Morrell       1
Henry Mowbray       1
'Big' Ben Moroz     1
Name: name, Length: 7802, dtype: int64

### Which actors or actresses appeared in the most movies in the year 1985?

In [64]:
cast[cast['year']==1985].groupby('name')['name'].count().sort_values(ascending = False)

name
Mammootty            22
Shakti Kapoor        21
Sukumari             20
Lou Scheimer         15
Mohanlal             15
                     ..
Melissa Randel        1
Melissa Rasmussen     1
Melissa Townsend      1
Melissa Triolo        1
'Chico' Hernandez     1
Name: name, Length: 22609, dtype: int64

### How many roles Mammootty has played in each year of his career.

In [66]:
cast[cast['name'] == 'Mammootty']['name'].count()

275

### What are the 10 most frequent roles that start with the phrase "Patron in"?

In [79]:
#str.startswith('b')

cast[cast['character'].str.startswith("Patron in")].groupby("character")['character'].count().sort_values(ascending =False)\
.head(10)

character
Patron in Frisky Rabbit         16
Patron in the Coffee House       9
Patron in Chinese Restaurant     9
Patron in Billiard Parlor        5
Patron in restaurant             4
Patron in Bar                    4
Patron in Club                   3
Patron in cabaret                3
Patron in Restaurant             3
Patron in Quiet Bar              2
Name: character, dtype: int64

### What are the 10 most frequent roles that start with the word "Science"?

In [80]:
cast[cast['character'].str.startswith("Science")].groupby("character")['character'].count().sort_values(ascending =False)\
.head(10)

character
Science Teacher         60
Science Fair Student     9
Science Student          9
Science Fair Judge       6
Science Club Member      5
Science Kid              5
Science Promo Cadet      5
Science Reporter         5
Science                  4
Science Fair Kid         3
Name: character, dtype: int64

### Count number of n-values of the roles that Judi Dench has played over her career.

In [83]:
cast[(cast['name'] == "Judi Dench") & (cast['n'].notnull())]['name'].count()

48

### Count number of n-values of Cary Grant's roles through his career.

In [88]:
cast[(cast['name'] == "Cary Grant") & (cast['n'].notnull())]['name'].count()

75

### Count number of n-value of the roles that Sidney Poitier has acted over the years.

In [89]:
cast[(cast['name'] == "Sidney Poitier") & (cast['n'].notnull())]['name'].count()

42

### How many leading (n=1) roles were available to actors, and how many to actresses, in the 1950s?

In [94]:
cast[(cast['n']==1) & (cast['year'].between(1950,1959,inclusive = True))].groupby('type')['type'].count()

type
actor      6616
actress    2965
Name: type, dtype: int64

### How many supporting (n=2) roles were available to actors, and how many to actresses, in the 1950s?

In [95]:
cast[(cast['n']==2) & (cast['year'].between(1950,1959,inclusive = True))].groupby('type')['type'].count()

type
actor      4564
actress    4556
Name: type, dtype: int64